function H2to1 = computeH(p1,p2)
%COMPUTEH 此处显示有关此函数的摘要
%   A*h=0
%   
%   
%p1 = [1,2,3,4;5,6,7,8];
%p2 = [1,2,3,4;5,6,7,8];
A = [];
%ax = [-x1,-y1,-1,0,0,0,x2'x1,x2'y1,x2']
%ay = [0,0,0,-x1,-y1,-1,y2'x1,y2'y1,y2']
%注意 x1y1是p2
%A=[ax1;ay1;...axn;ayn]
for i = 1:size(p1,2) 
    ax = [-p2(1,i),-p2(2,i),-1,...
          0,0,0,...
          p1(1,i)*p2(1,i),p1(1,i)*p2(2,i),p1(1,i)];
    ay = [0,0,0,...
          -p2(1,i),-p2(2,i),-1,...
          p1(2,i)*p2(1,i),p1(2,i)*p2(2,i),p1(2,i)];
    C = [ax;ay];
    A = cat(1,A,C);
end
[U,D,V] = svd(A);
h = V(:,end);
H2to1 = [h(1),h(2),h(3);
         h(4),h(5),h(6);
         h(7),h(8),h(9)];
end

